//=====================================
// Chocolate  C
// 按数学归纳法,对于n*m的矩阵,一次下刀只能将一块巧克力一分为二
// 其切法为:横向切n-1刀,构成n条,故纵向共切n(m-1)刀,合计n-1+n(m-1)=nm-1
// 针对n,m很大,结果要求刀数为除以10000的余数,即(n*m-1)%10000
// 考虑到溢出,结果不能是负数,所以上式改为
//    (n*m-1)%10000
//  = ((n*m)%10000 - 1%10000)            // 拆成两部分
//  = ((n%10000) * (m%10000) - 1)%10000  // 取了余数再相乘,结果仍可能超10000,故仍要取余
//  = ((n%10000) * (m%10000) - 1 + 10000)%10000  // 排除nm都为10000的整数倍,括号中得出-1的荒唐值
//  = ((n%10000) * (m%10000) + 9999)%10000
//=====================================
#include<iostream>
using namespace std;
//-------------------------------------
int main(){
  for(long long int n,m; cin>>n>>m && (n||m); )
    cout<<((m%10000)*(n%10000)+9999)%10000<<"\n";
}//====================================
